students = {
    1: ("Иванов", [5, 4, 3, 4]),
    2: ("Петров", [4, 4, 5, 5]),
    3: ("Сидоров", [3, 3, 4, 5]),
    4: ("Кузнецов", [5, 5, 5, 5]),
    5: ("Смирнов", [4, 3, 3, 4]),
    6: ("Попов", [2, 3, 4, 3]),
    7: ("Дуров", [5, 5, 4, 5]),
    8: ("Михайлов", [3, 4, 4, 4])
}

# Выводим фамилии студентов и их средний балл
for student in students.values():
    name = student[0]
    grades = student[1]
    average_grade = sum(grades) / len(grades)

    print(f"Студент: {name}, Средний балл: {average_grade:.2f}")
