students = {
    1: ("Иванов", {"Математика": 5, "Физика": 4, "Информатика": 3, "Химия": 4}),
    2: ("Петров", {"Математика": 4, "Физика": 4, "Информатика": 5, "Химия": 5}),
    3: ("Сидоров", {"Математика": 3, "Физика": 3, "Информатика": 4, "Химия": 5}),
    4: ("Кузнецов", {"Математика": 5, "Физика": 5, "Информатика": 5, "Химия": 5}),
    5: ("Смирнов", {"Математика": 4, "Физика": 3, "Информатика": 3, "Химия": 4}),
    6: ("Попов", {"Математика": 2, "Физика": 3, "Информатика": 4, "Химия": 3}),
    7: ("Дуров", {"Математика": 5, "Физика": 5, "Информатика": 4, "Химия": 5}),
    8: ("Михайлов", {"Математика": 3, "Физика": 4, "Информатика": 4, "Химия": 4})
}

# Выводим фамилии студентов и их средний балл по каждому предмету
for student in students.values():
    name = student[0]
    grades = student[1]

    # Вычисляем средний балл по каждому предмету
    average_grade = sum(grades.values()) / len(grades)

    print(f"Студент: {name}")
    for subject, grade in grades.items():
        print(f"  {subject}: {grade}")
    print(f"  Средний балл: {average_grade:.2f}")
